OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
        if (isr & SDH_INTSTS_CDSTS_Msk) {
            printf("\n***** card remove !\n");
            SD1.IsCardInsert = FALSE;   // SDISR_CD_Card = 1 means card remove for GPIO mode
            memset(&SD1, 0, sizeof(SDH_INFO_T));
        } else {
            printf("***** card insert !\n");
            SDH_Open(SDH1, CardDetect_From_GPIO);
            SDH_Probe(SDH1);
        }

        SDH1->INTSTS = SDH_INTSTS_CDIF_Msk;
    }

    // CRC error interrupt
    if (isr & SDH_INTSTS_CRCIF_Msk) {
        if (!(isr & SDH_INTSTS_CRC16_Msk)) {
            //printf("***** ISR sdioIntHandler(): CRC_16 error !\n");
            // handle CRC error
        } else if (!(isr & SDH_INTSTS_CRC7_Msk)) {
            if (!g_u8R3Flag) {
                //printf("***** ISR sdioIntHandler(): CRC_7 error !\n");
                // handle CRC error
            }
        }
        SDH1->INTSTS = SDH_INTSTS_CRCIF_Msk;      // clear interrupt flag
    }

    if (isr & SDH_INTSTS_DITOIF_Msk) {
        printf("***** ISR: data in timeout !\n");
        SDH1->INTSTS |= SDH_INTSTS_DITOIF_Msk;
    }

    // Response in timeout interrupt
    if (isr & SDH_INTSTS_RTOIF_Msk) {
        printf("***** ISR: response in timeout !\n");
        SDH1->INTSTS |= SDH_INTSTS_RTOIF_Msk;
    }
}

uint32_t ETimer1_cnt = 0;

void ETMR1_IRQHandler(void)
{
    ETimer1_cnt++;
    //printf("ETimer1_cnt = %d\n",ETimer1_cnt);
    // clear timer interrupt flag
    ETIMER_ClearIntFlag(1);
    if (ETimer1_cnt >= 10) {
        printf("Time-out\n");
        ETIMER_Stop(1);
        while(1) {
            WDT_RSTCNT;
        }
    }
}

void ETimer1_Init(void)
{
    // Enable ETIMER1 engine clock
    outpw(REG_CLK_PCLKEN0, inpw(REG_CLK_PCLKEN0) | (1 << 9));

    // Set timer frequency to 1HZ
    ETIMER_Open(1, ETIMER_PERIODIC_MODE, 1);

    // Enable timer interrupt
    ETIMER_EnableInt(1);
    sysInstallISR(IRQ_LEVEL_1, IRQ_TIMER1, (PVOID)ETMR1_IRQHandler);
    sysSetLocalInterrupt(ENABLE_IRQ);
    sysEnableInterrupt(IRQ_TIMER1);
}


void SYS_Init(void)
{
    /* enable SDH */
    outpw(REG_CLK_HCLKEN, inpw(REG_CLK_HCLKEN) | 0x40000000);

    outpw(REG_CLK_HCLKEN,  inpw(REG_CLK_HCLKEN)  | (1<<20)); //Enable FMI clock
    outpw(REG_CLK_HCLKEN,  inpw(REG_CLK_HCLKEN)  | (1<<22)); //Enable SD0 clock
    outpw(REG_CLK_HCLKEN,  inpw(REG_CLK_HCLKEN)  | (1<<21)); //Enable NAND clock
    outpw(REG_CLK_HCLKEN,  inpw(REG_CLK_HCLKEN)  | (1<<30)); //Enable SD1 clock

    /* enable QSPI0 */
    outpw(REG_CLK_PCLKEN1, inpw(REG_CLK_PCLKEN1) | 0x10);

    /* enable WDT clock */
    outpw(REG_CLK_PCLKEN0, inpw(REG_CLK_PCLKEN0) | 0x1);

    /* select multi-function-pin */
    /* SD Port 0 -> PF0~6 */
    outpw(REG_SYS_GPF_MFPL, (inpw(REG_SYS_GPF_MFPL)&0x0FFFFFFF) | 0x02222222);
    //SD_Drv = 0;
}

/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */

unsigned long get_fattime (void)
{
    unsigned long tmr;

    tmr=0x00000;

    return tmr;
}

void UART_Init()
{
    /* enable UART0 clock */
    outpw(REG_CLK_PCLKEN0, inpw(REG_CLK_PCLKEN0) | 0x10000);

    /* GPF11, GPF12 */
    outpw(REG_SYS_GPF_MFPH, (inpw(REG_SYS_GPF_MFPH) & 0xfff00fff) | 0x11000);   // UART0 multi-function

    /* UART0 line configuration for (115200,n,8,1) */
    outpw(REG_UART0_LCR, inpw(REG_UART0_LCR) | 0x07);
    outpw(REG_UART0_BAUD, 0x30000066); /* 12MHz reference clock input, 115200 */
}

static FIL file1, file2;        /* File objects */

DIR dir;                /* Directory object */
UINT s1, s2, s3, s4, cnt;
FRESULT result;
char *ptr;
FATFS   *fs;              /* Pointer to file system object */
TCHAR   sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */
FILINFO Finfo;
long    p1, p2, p3;
static FIL file1, file2;        /* File objects */

BYTE DDR_Line[80][23];
UINT32 DDRInitAddr[80];
UINT32 DDRInitData[80];
UINT32 DDRInitCount = 0;


static BYTE my_atoi(char src)
{
    BYTE c = 0;
    if ((src >= '0') && (src <= '9'))
        c = src - '0';
    else if ((src >= 'a') && (src <= 'f'))
        c = 0xa + src - 'a';
    else if ((src >= 'A') && (src <= 'F'))
        c = 0xA + src - 'A';
    return (c);
}

static void _parsing_DDRInit(int FileLen)
{
    int src_c = 0;
    int dest_c = 0;
    int LineNo = 0;
    int IsAddr = 1;

    DDRInitCount = 0;

    while (src_c < FileLen) {
        //sysprintf("[%d][%x][%x]\n",src_c,Buff[src_c], Buff[src_c+1]);
        if ((Buff[src_c] == 0x30) && (Buff[src_c+1] == 0x78)) {//skip 0x
            src_c += 2;
            continue;
        }
        if ((Buff[src_c] == 0xD) && (Buff[src_c+1] == 0xA)) {//Line end
            if ((Buff[src_c+2] == 0x30) && (Buff[src_c+3] == 0x78)) {
                src_c += 2;
                LineNo++;
                dest_c = 0;
                IsAddr ^= 1;
                DDRInitCount++;
                continue;
            }
        }

        if (Buff[src_c] == 0x3D) { //"="
            src_c++;
            IsAddr ^= 1;
            continue;
        }

        if (IsAddr)
            DDRInitAddr[LineNo] = DDRInitAddr[LineNo] * 16 + my_atoi(Buff[src_c]);
        else
            DDRInitData[LineNo] = DDRInitData[LineNo] * 16 + my_atoi(Buff[src_c]);

        DDR_Line[LineNo][dest_c] = Buff[src_c];
        //sysprintf("c=[%d],Buff[c]=[%x],LineNo=%d,Line[%d][%d]=%x\n",src_c,Buff[src_c],LineNo,LineNo,dest_c,Line[LineNo][dest_c]);
        src_c++;
        dest_c++;
    }

    DDRInitCount += 1; //The last line

    printf("Total initail data count = %d\n",DDRInitCount);
}

static unsigned int CalculateCRC32(unsigned char * buf,unsigned int len)
{
    unsigned int i;
    unsigned int crc32;
    unsigned char* byteBuf;

    crc32 = 0 ^ 0xFFFFFFFF;
    byteBuf = (unsigned char *) buf;
    for (i=0; i < len; i++) {
        crc32 = (crc32 >> 8) ^ crc32_table[ (crc32 ^ byteBuf[i]) & 0xFF ];
    }
    return ( crc32 ^ 0xFFFFFFFF );
}

static void _parsing_EnvTxt(int FileLen, char *pEnv)
{
    int src_c =0;
    int dest_c = 4; /* The first four bytes are checksum */

    while (src_c < FileLen) {
        if (Buff[src_c] == 0) //EOF
            break;

        if ((Buff[src_c] == 0xD) && (Buff[src_c+1] == 0xA)) {//Line end
            pEnv[dest_c] = 0;
            src_c += 2;
            dest_c++;
        } else {
            pEnv[dest_c] = Buff[src_c];
            src_c++;
            dest_c++;
        }
    }

