OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
    *(unsigned int *)pEnv = CalculateCRC32((unsigned char *)(pEnv + 4), 0x10000 - 4);

    if (0) {
        int k;
        printf("ENV:\n");
        for (k=0; k<0x10000; k++) {
            printf("0x%x ",pEnv[k]);
            if (k && ((k+1)%16 == 0))
                printf("\n");
        }
        printf("\n");
    }

}

static void Form_BootCode_Header(unsigned int *header_size)
{
    FRESULT res;
    int i;

    memset((void*)Buff, 0xFF, BUFF_SIZE);
    printf("open DDR ini file [%s]\n", Ini_Writer.DDR.FileName);
    res = f_open(&file1, Ini_Writer.DDR.FileName, FA_OPEN_EXISTING | FA_READ);
    if (res)
        printf("res = %d\n",res);
    else
        printf("f_open [%s] ok\n", Ini_Writer.DDR.FileName);

    printf("read DDR ini file [%s]\n", Ini_Writer.DDR.FileName);
    res = f_read(&file1, Buff, BUFF_SIZE, &s1);
    if (res || s1 == 0) {
        printf("res = %d,read size = %d\n",res,s1);
        printf("Error while read file\n");
        while(1) {   /* error or eof */
            WDT_RSTCNT;
        }
    }

    _parsing_DDRInit(s1);

    //Form boot code header
    *(unsigned int*)(Buff + 0) = 0x4E565420; //Boot code marker
    *(unsigned int*)(Buff + 4) = Ini_Writer.Loader.address; //2nd word - Execution address
    *(unsigned int*)(Buff + 8) = Ini_Writer.Loader_size;  //3rd word - Image size
    *(unsigned int*)(Buff + 12) = 0xFFFFFFFF;

    if (Ini_Writer.UserDef_SPI.PageSizeDefined)
        *(unsigned int*)(Buff + 16) = ((Ini_Writer.UserDef_SPI.SpareArea) << 16)|(Ini_Writer.UserDef_SPI.PageSize);//0x00400800;
    else
        *(unsigned int*)(Buff + 16) = (info.SPINand_SpareArea << 16)|(info.SPINand_PageSize);//0x00400800;

    if (Ini_Writer.UserDef_SPI.QuadCmdDefined) {
        *(unsigned int*)(Buff + 20) = ((Ini_Writer.UserDef_SPI.QuadReadCmd)
                                       |(Ini_Writer.UserDef_SPI.ReadStatusCmd << 8)
                                       |(Ini_Writer.UserDef_SPI.WriteStatusCmd << 16)
                                       |(Ini_Writer.UserDef_SPI.StatusValue << 24)); //0x023135EB
        *(unsigned int*)(Buff + 24) = (Ini_Writer.UserDef_SPI.DummyByte) | 0xFFFFFF00;
    } else {
        *(unsigned int*)(Buff + 20) = ((info.SPINand_QuadReadCmd)
                                       |(info.SPINand_ReadStatusCmd << 8)
                                       |(info.SPINand_WriteStatusCmd << 16)
                                       |(info.SPINand_StatusValue << 24)); //0x023135EB
        *(unsigned int*)(Buff + 24) = (info.SPINand_dummybyte) | 0xFFFFFF00;
    }
    *(unsigned int*)(Buff + 28) = 0xFFFFFFFF;

    *(unsigned int*)(Buff + 32) = 0xAA55AA55;
    *(unsigned int*)(Buff + 32 + 4) = DDRInitCount;

    printf("Copy DDR init data to Buff\n");
    for (i=0; i<DDRInitCount; i++) {
        *(unsigned int*)(Buff + 32 + 8 + (8*i)) = DDRInitAddr[i];
        *(unsigned int*)(Buff + 32 + 8 + (8*i) + 4) = DDRInitData[i];
    }

    //U-Boot should be put in 16 byte align
    if ((DDRInitCount%2) == 0) {
        for (i=0; i<8; i++)
            Buff[32 + 8 + DDRInitCount*8 + i] = 0xff; //Set dumy byte to 0xff
    }

    if (DDRInitCount%2)
        *header_size = 32 + 8 + (DDRInitCount*8);
    else {
        *header_size = 32 + 8 + (DDRInitCount*8) + 8;
    }

    f_close(&file1);
}

int32_t main(void)
{
    char        *ptr, *ptr2;
    long        p1, p2, p3;
    BYTE        *buf;
    FATFS       *fs;              /* Pointer to file system object */
    TCHAR       sd_path[] = { '1', ':', 0 };    /* SD drive started from 0 */
    FRESULT     res;

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;
    UINT ImgNo,ImageCnt;

    *(volatile unsigned int *)(CLK_BA+0x18) |= (1<<16); /* Enable UART0 */
    UART_Init();
    printf("\n");
    printf("===============================================\n");
    printf("          SD Writer                            \n");
    printf("===============================================\n");

    sysDisableCache();
    sysFlushCache(I_D_CACHE);
    sysEnableCache(CACHE_WRITE_BACK);

    Buff = (BYTE *)((UINT32)&Buff_Pool[0] | 0x80000000);   /* use non-cache buffer */
    Block_Buff = (BYTE *)((UINT32)&Block_Buff_Pool[0] | 0x80000000);   /* use non-cache buffer */

    SYS_Init();
    WDT_RSTCNT;
    outpw(REG_WDT_CTL, (inpw(REG_WDT_CTL) & ~(0xf << 8))|(0x8<<8));// timeout 2^20 * (12M/512) = 44 sec

    ETimer1_Init();
    fmiHWInit();

    sysInstallISR(IRQ_LEVEL_1, IRQ_SDH, (PVOID)SDH_IRQHandler);
    /* enable CPSR I bit */
    sysSetLocalInterrupt(ENABLE_IRQ);
    sysEnableInterrupt(IRQ_SDH);

    SDH_Open_Disk(SDH1, CardDetect_From_GPIO);
    f_chdrive(sd_path);          /* set default path */


    SDH_CardDetection(SDH1);


    while (*ptr == ' ') ptr++;
    res = f_opendir(&dir, ptr);
    if (res) {
        put_rc(res);
        printf("res = %d\n",res);
    }
    p1 = s1 = s2 = 0;
    for(;;) {
        WDT_RSTCNT;
        res = f_readdir(&dir, &Finfo);
        if ((res != FR_OK) || !Finfo.fname[0]) break;
        if (Finfo.fattrib & AM_DIR) {
            s2++;
        } else {
            s1++;
            p1 += Finfo.fsize;
        }
        printf("%c%c%c%c%c %d/%02d/%02d %02d:%02d    %9d  %s",
               (Finfo.fattrib & AM_DIR) ? 'D' : '-',
               (Finfo.fattrib & AM_RDO) ? 'R' : '-',
               (Finfo.fattrib & AM_HID) ? 'H' : '-',
               (Finfo.fattrib & AM_SYS) ? 'S' : '-',
               (Finfo.fattrib & AM_ARC) ? 'A' : '-',
               (Finfo.fdate >> 9) + 1980, (Finfo.fdate >> 5) & 15, Finfo.fdate & 31,
               (Finfo.ftime >> 11), (Finfo.ftime >> 5) & 63, (unsigned int)Finfo.fsize, Finfo.fname);
#if _USE_LFN
        for (p2 = strlen(Finfo.fname); p2 < 14; p2++)
            printf(" ");
        printf("%s\n", Lfname);
#else
        printf("\n");
#endif
        if (Finfo.fattrib & AM_DIR) {

        }
    }
    printf("%4d File(s),%10d bytes total\n%4d Dir(s)", s1, (int)p1, s2);
    if (f_getfree(ptr, (DWORD*)&p1, &fs) == FR_OK)
        printf(", %10d bytes free\n", (int)p1 * fs->csize * 512);



    printf("Opening \"%s\"", "config");
    res = f_open(&file1, "config", FA_OPEN_EXISTING | FA_READ);
    printf("\n");
    if (res) {
        put_rc(res);
        printf("[config] res = %d\n",res);
    }

    p1 = 0;
    for (;;) {
        WDT_RSTCNT;
        res = f_read(&file1, Buff, BUFF_SIZE, &s1);
        if (res || s1 == 0) break;   /* error or eof */
        printf("Buff = %s\n",Buff);
    }
    f_close(&file1);

