OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
                        if(Enable4ByteFlag)
                            printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                        res = f_read(&file2, Buff, SPI_BLOCK_SIZE, &s2);
                        if (res || s2 == 0) {
                            printf("res = %d,read size = %d\n",res,s2);
                            while(1) {   /* error or eof */
                                WDT_RSTCNT;
                            }
                        }

                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        spiEraseSector(offset, 1);
                        spiWrite(offset, SPI_BLOCK_SIZE, (UINT8 *)Buff);
                        ETIMER_Stop(1);
                        WDT_RSTCNT;

                        offset += SPI_BLOCK_SIZE;

                        //ack status
                        //tmplen += SPI_BLOCK_SIZE;
                        //SendAck((tmplen * 95) / len);
                    }
                    if ((len % (SPI_BLOCK_SIZE)) != 0) {
                        WDT_RSTCNT;
                        printf("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
                        // 4Byte Address Mode (>16MByte)
                        Enable4ByteFlag = 0;
                        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;
                        if(offset > SPI_FLASH_SIZE)
                            Enable4ByteFlag = 1;

                        if(Enable4ByteFlag)
                            printf("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

                        len = len - blockCount*SPI_BLOCK_SIZE;
                        res = f_read(&file2, Buff, len, &s2);
                        if (res || s2 == 0) {
                            printf("res = %d,read size = %d\n",res,s2);
                            while(1) {   /* error or eof */
                                WDT_RSTCNT;
                            }
                        }
                        ETimer1_cnt = 0;
                        ETIMER_Start(1);
                        spiEraseSector(offset, 1);
                        spiWrite(offset, len, (UINT8 *)Buff);
                        ETIMER_Stop(1);
                        WDT_RSTCNT;
                    }
                }

                f_close(&file2);
                printf("Write [%s] to SPI flash ... done\n",Ini_Writer.UserImage[ImgNo].FileName);
            }
        }

        if (Ini_Writer.Env.user_choice == 1) {
            WDT_RSTCNT;
            printf("open [%s]\n",Ini_Writer.Env.FileName);
            result = f_open(&file2, Ini_Writer.Env.FileName, FA_OPEN_EXISTING | FA_READ);
            if (result)
                printf("result = %d\n",result);
            else
                printf("f_open [%s] ok\n",Ini_Writer.Env.FileName);

            printf("read [%s]\n",Ini_Writer.Env.FileName);
            result = f_read(&file2, Buff, SPI_BLOCK_SIZE, &s2);
            if (result || s2 == 0) {
                printf("result = %d,read size = %d\n",result,s2);
                //break;   /* error or eof */
            } else
                printf("[%s] size = %d\n",Ini_Writer.Env.FileName,s2);

            pENV = (char*)malloc(0x10000);
            if (!pENV) {
                printf("malloc fail [%s][%d]\n",__FUNCTION__,__LINE__);
                while(1) {
                    WDT_RSTCNT;
                }
            }
            memset((void*)pENV,0,0x10000);
            _parsing_EnvTxt(s2,pENV);
            f_close(&file2);

            //Burn to SPI flash
            printf("Write Environment variable to SPI flash offset [%x] ... start\n", Ini_Writer.Env.address);
            ETimer1_cnt = 0;
            ETIMER_Start(1);
            spiEraseSector(Ini_Writer.Env.address, 1);
            spiWrite(Ini_Writer.Env.address, SPI_BLOCK_SIZE, (UINT8 *)pENV);
            ETIMER_Stop(1);
            WDT_RSTCNT;
            printf("Write Environment variable to SPI flash ... done\n");
        }
    }
    if (Ini_Writer.Type == TYPE_SPI_NAND) {
        printf("Write Type is SPI NAND\n");
        /* Initial SPI NAND */
        spiNANDInit();

        if (Ini_Writer.Loader.user_choice == 1) {
            unsigned int i,write_len,blkindx,end_blk,page,page_count;
            unsigned char status;
            unsigned char *addr;
            int offset=0, blockCount, len;
            unsigned int header_size;

            WDT_RSTCNT;
            printf("open [%s]\n", Ini_Writer.Loader.FileName);
            res = f_open(&file2, Ini_Writer.Loader.FileName, FA_OPEN_EXISTING | FA_READ);
            if (res)
                printf("result = %d\n",res);
            else
                printf("f_open [%s] ok\n", Ini_Writer.Loader.FileName);

            //Burn to SPI NAND flash
            printf("Write SPL to [%s] NAND flash ... start\n",Ini_Writer.Loader.FileName);

            //Write the first block
            Form_BootCode_Header(&header_size);

            write_len = MIN(((pSN->SPINand_PagePerBlock)*(pSN->SPINand_PageSize)), Ini_Writer.Loader_size);
            res = f_read(&file2, Buff + header_size, write_len, &s2);
            if (res) {
                printf("res = %d,read size = %d\n",res,s2);
                while(1) {   /* error or eof */
                    WDT_RSTCNT;
                }
            }

            page_count = write_len/pSN->SPINand_PageSize;
            if (write_len % pSN->SPINand_PageSize)
                page_count++;

            // erase block
            end_blk = 4;
            for(blkindx=0; blkindx<end_blk; blkindx++) {
_retry_spinand_1:
                if (blkindx > pSN->SPINand_BlockPerFlash) {
                    printf("Write out of SPI NAND flash!\n");
                    while(1) {
                        WDT_RSTCNT;
                    }
                }
                WDT_RSTCNT;
                addr = (unsigned char*)Buff;
                page = pSN->SPINand_PagePerBlock * (blkindx);
                printf("blkindx = %d   page = %d   page_count=%d\n", blkindx, page, page_count);
                spiNAND_BlockErase(((page>>8)&0xFF), (page&0xFF)); // block erase
                status = spiNAND_StatusRegister(3);
                status = (status&0x0C)>>2;
                if (status != 0) {
                    if(spiNAND_bad_block_check(page)) {
                        printf("Bad block[%d]!\n",blkindx);
                    }
                    blkindx++;
                    end_blk++;
                    goto _retry_spinand_1;
                }
                // write block
                for (i=0; i<page_count; i++) {
                    //printf("page+i=%d\n",page+i);
                    WDT_RSTCNT;
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                    spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
                    ETIMER_Stop(1);
                    WDT_RSTCNT;
                    status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                    if (status != 0) {
                        if (spiNAND_bad_block_check(page)) {
                            printf("Bad block[%d]!\n",blkindx);
                        }
                        blkindx++;
                        end_blk++;
                        goto _retry_spinand_1;
                    }
                    addr += pSN->SPINand_PageSize;
                    //pagetmp++;
                }
            }
            f_close(&file2);
            printf("Write [%s] to SPI NAND flash ... done\n",Ini_Writer.Loader.FileName);
        }

        if (Ini_Writer.UserImage[0].user_choice == 1) {
            unsigned int i,blkindx,startblk,endblk,page,blk_count,page_count,remain_size,len;
            unsigned char status;
            unsigned int addr;

