OpenNuvoton/NUC980_SDWriter/SampleCode/SD_Writer/main.c
            WDT_RSTCNT;
            printf("open [%s]\n",Ini_Writer.Env.FileName);
            result = f_open(&file2, Ini_Writer.Env.FileName, FA_OPEN_EXISTING | FA_READ);
            if (result)
                printf("result = %d\n",result);
            else
                printf("f_open [%s] ok\n",Ini_Writer.Env.FileName);

            printf("read [%s]\n",Ini_Writer.Env.FileName);
            result = f_read(&file2, Buff, BUFF_SIZE, &s2);
            if (result || s2 == 0) {
                printf("result = %d,read size = %d\n",result,s2);
                //break;   /* error or eof */
            } else
                printf("[%s] size = %d\n",Ini_Writer.Env.FileName,s2);

            pENV = (char*)malloc(0x10000);
            if (!pENV) {
                printf("malloc fail [%s][%d]\n",__FUNCTION__,__LINE__);
                while(1) {
                    WDT_RSTCNT;
                }
            }
            memset((void*)pENV,0,0x10000);
            _parsing_EnvTxt(s2,pENV);
            f_close(&file2);

            //Burn to NAND flash
            printf("Write Environment variable to NAND flash offset [%x] ... start\n", Ini_Writer.Env.address);
            addr = (unsigned int)pENV;
            page_count = pSM->uPagePerBlock;
            //blkindx = Ini_Writer.Env.address/(Ini_Writer.Env.DataSize/((pSM->uPagePerBlock)*(pSM->uPageSize)));
            blkindx = Ini_Writer.Env.address/((pSM->uPagePerBlock)*(pSM->uPageSize));
_retry_3:
            if (blkindx > pSM->uBlockPerFlash) {
                printf("Write out of NAND flash!\n");
                while(1) {
                    WDT_RSTCNT;
                }
            }
            page = pSM->uPagePerBlock * (blkindx);
            printf("Erase block [%d]\n",blkindx);
            status = fmiSM_BlockErase(pSM, blkindx);
            if (status != 0) {
                fmiMarkBadBlock(pSM, blkindx);
                blkindx++;
                goto _retry_3;
            }

            // write block
            for (i=0; i<page_count; i++) {
                //printf("write page [%d]\n",page+i);
                ETimer1_cnt = 0;
                ETIMER_Start(1);
                status = fmiSM_Write_large_page(page+i, 0, addr);
                ETIMER_Stop(1);
                if (status != 0) {
                    fmiMarkBadBlock(pSM, blkindx);
                    printf("Bad block [%d]\n",blkindx);
                    blkindx++;
                    goto _retry_3;
                }
                addr += pSM->uPageSize;
                //pagetmp++;
            }
            printf("Write Environment variable to NAND flash ... done\n");
        }
    }
    if (Ini_Writer.Type == TYPE_EMMC) {
        int eMMCBlockSize, len;

        printf("Write Type is EMMC\n");
        /* initial eMMC */
        eMMCBlockSize=fmiInitSDDevice();
        if(eMMCBlockSize>0) {
            info.EMMC_uReserved=GetMMCReserveSpace();
            printf("eMMC_uReserved =%d ...\n",info.EMMC_uReserved);
            info.EMMC_uBlock=eMMCBlockSize;
        }

        printf("eMMCBlockSize=0x%08x(%d) \n",eMMCBlockSize, eMMCBlockSize);

        if (Ini_Writer.Loader.user_choice == 1) {
            unsigned int header_size;
            int offset = 0x400;

            WDT_RSTCNT;
            printf("open [%s]\n", Ini_Writer.Loader.FileName);
            res = f_open(&file2, Ini_Writer.Loader.FileName, FA_OPEN_EXISTING | FA_READ);
            if (res)
                printf("result = %d\n",res);
            else
                printf("f_open [%s] ok\n", Ini_Writer.Loader.FileName);

            //Burn Loader to eMMC
            printf("Write [%s] to eMMC ... start\n",Ini_Writer.Loader.FileName);
            Form_BootCode_Header(&header_size);

            res = f_read(&file2, Buff + header_size, (EMMC_BLOCK_SIZE - header_size), &s2);
            if (res || s2 == 0) {
                printf("res = %d,read size = %d\n",res,s2);
                while(1) {   /* error or eof */
                    WDT_RSTCNT;
                }
            }
            fmiSD_Write((0x400/SD_SECTOR),(s2 + header_size)/SD_SECTOR,(UINT32)Buff);
            offset += EMMC_BLOCK_SIZE;
            //Write remain part of loader
            len = Ini_Writer.Loader_size - (EMMC_BLOCK_SIZE - header_size);
            if (len > 0) {
                int read_idx, read_count;
                read_count = len / EMMC_BLOCK_SIZE;
                for (read_idx = 0; read_idx < read_count; read_idx++) {
                    WDT_RSTCNT;
                    res = f_read(&file2, Buff, EMMC_BLOCK_SIZE, &s2);
                    if (res || s2 == 0) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    fmiSD_Write((offset/SD_SECTOR),EMMC_BLOCK_SIZE/SD_SECTOR,(UINT32)Buff);
                    ETIMER_Stop(1);
                    WDT_RSTCNT;
                    offset += EMMC_BLOCK_SIZE;
                }
                //Write the last part of loader that is less than EMMC_BLOCK_SIZE
                if (len % EMMC_BLOCK_SIZE) {
                    res = f_read(&file2, Buff, len - (read_count * EMMC_BLOCK_SIZE), &s2);
                    if (res || s2 == 0) {
                        printf("res = %d,read size = %d\n",res,s2);
                        while(1) {   /* error or eof */
                            WDT_RSTCNT;
                        }
                    }
                    ETimer1_cnt = 0;
                    ETIMER_Start(1);
                    fmiSD_Write((offset/SD_SECTOR),s2/SD_SECTOR,(UINT32)Buff);
                    ETIMER_Stop(1);
                    WDT_RSTCNT;
                }
            }
        }

        printf("Write [%s] to eMMC ... done\n",Ini_Writer.Loader.FileName);
        f_close(&file2);

        if (Ini_Writer.UserImage[0].user_choice == 1) {
            for (ImgNo = 0; ImgNo < ImageCnt; ImgNo++) {
                WDT_RSTCNT;
                printf("open [%s]\n", Ini_Writer.UserImage[ImgNo].FileName);
                res = f_open(&file2, Ini_Writer.UserImage[ImgNo].FileName, FA_OPEN_EXISTING | FA_READ);
                if (res)
                    printf("result = %d\n",res);
                else
                    printf("f_open [%s] ok\n", Ini_Writer.UserImage[ImgNo].FileName);

